{"posts":[{"id":2536308343,"title":"5 ways to create an HTTP server in Golang","subTitle":"Since Go was released, it has gotten better, and more tools and frameworks created for different purposes that make Go programming and maintenance easier. Choosing the right Golang HTTP framework depends on your priorities. net/http offers flexibility and control but can be verbose. FastHTTP prioritizes performance but requires more manual configuration. Gin and Fiber balance performance and features, while Echo is highly customizable. Consider your project's needs and your development style to make the best choice.","createdAt":"2024-09-19T13:12:24Z","publishedAt":"2024-09-27T14:52:42Z","categories":[{"id":7182094946},{"id":7525890842}],"url":"https://m8e.ir/blog/2536308343-5-ways-to-create-an-http-server-in-golang.html"},{"id":2397766859,"title":"Don't treat technical design document as a dilemma!","subTitle":"The discussed content highlights the importance of documentation in software development, stressing its role in project clarity and success. While clear, self-explanatory code is ideal, complex projects may benefit from detailed technical design documents (TDDs) to aid understanding and collaboration. TDDs facilitate communication, manage project intricacies, and foresee issues, enhancing project outcomes. However, in certain contexts like small projects or agile environments, extensive TDDs may be unnecessary. Alternative documentation methods such as wikis, diagrams, or well-commented code can effectively capture essential design decisions. Context-specific factors like project complexity and time constraints should inform decisions on formal TDD creation, recognizing the importance of adaptability in documentation approaches.","createdAt":"2024-07-09T10:16:28Z","publishedAt":"2024-08-15T15:47:38Z","categories":[{"id":7182094946},{"id":7182108372}],"url":"https://m8e.ir/blog/2397766859-don't-treat-technical-design-document-as-a-dilemma.html"},{"id":2363433053,"title":"When should and should not REFACTOR?","subTitle":"The article discusses the importance of understanding the project complexity matrix for effective project management. It highlights the benefits and risks associated with refactoring code. Refactoring offers advantages like increased productivity and bug identification but carries risks such as regressions and dormant bugs. The author advises against refactoring without clear objectives, for fun, or when time is limited. Instead, refactoring should be considered in scenarios like dealing with a small scope, code complexity hindering development, shifting product requirements, performance optimization, or adopting new technologies. The article emphasizes the need for strategic refactoring, considering the system, team, and business context to improve code quality and support future development.","createdAt":"2024-06-20T03:37:47Z","publishedAt":"2024-07-18T20:08:36Z","categories":[{"id":7034738719},{"id":7182108372}],"url":"https://m8e.ir/blog/2363433053-when-should-and-should-not-refactor.html"},{"id":2345716869,"title":"You want to create a SaaS? here is important key factors - part2","subTitle":"Explore vital factors for building robust SaaS apps. Learn about stateless processes, port binding, concurrency, disposability, dev/prod parity, logs, and admin tasks. These practices ensure scalability, fast startup/shutdown, consistent environments, effective logging, and streamlined administration. Implement them to strengthen your software as a service projects. Stay tuned for more insights on the remaining factors!","createdAt":"2024-06-11T08:15:50Z","publishedAt":"2024-06-14T18:41:04Z","categories":[{"id":7024776435},{"id":7034733899},{"id":7034738719}],"url":"https://m8e.ir/blog/2345716869-you-want-to-create-a-saas-here-is-important-key-factors-part2.html"},{"id":2328841453,"title":"You want to create a SaaS? here is important key factors - part1","subTitle":"Software as a Service (SaaS) is a cloud-based software model that delivers applications to end-users through an internet browser. SaaS vendors host services and applications for customers to access on-demand. With a SaaS offering, you do not have to think about how the service is maintained or how the underlying infrastructure is managed","createdAt":"2024-06-01T02:48:16Z","publishedAt":"2024-06-03T18:08:21Z","categories":[{"id":7024776435},{"id":7034733899},{"id":7034738719}],"url":"https://m8e.ir/blog/2328841453-you-want-to-create-a-saas-here-is-important-key-factors-part1.html"}],"categories":[{"id":7182094946,"name":"software design","color":"#D93F0B","description":"","posts":[{"id":2536308343,"categories":[{"id":7182094946},{"id":7525890842}]},{"id":2397766859,"categories":[{"id":7182094946},{"id":7182108372}]}]},{"id":7525890842,"name":"software development","color":"#B60205","description":"","posts":[{"id":2536308343,"categories":[{"id":7182094946},{"id":7525890842}]}]},{"id":7182108372,"name":"system maintenance","color":"#20ACF1","description":"","posts":[{"id":2397766859,"categories":[{"id":7182094946},{"id":7182108372}]},{"id":2363433053,"categories":[{"id":7034738719},{"id":7182108372}]}]},{"id":7034738719,"name":"cloud","color":"#CF1451","description":"","posts":[{"id":2363433053,"categories":[{"id":7034738719},{"id":7182108372}]},{"id":2345716869,"categories":[{"id":7024776435},{"id":7034733899},{"id":7034738719}]},{"id":2328841453,"categories":[{"id":7024776435},{"id":7034733899},{"id":7034738719}]}]},{"id":7024776435,"name":"methodology","color":"#05FAFA","description":"Talk about available methodologies in software world","posts":[{"id":2345716869,"categories":[{"id":7024776435},{"id":7034733899},{"id":7034738719}]},{"id":2328841453,"categories":[{"id":7024776435},{"id":7034733899},{"id":7034738719}]}]},{"id":7034733899,"name":"SaaS","color":"#F8E208","description":"Talk about SaaS and its related topic in software world","posts":[{"id":2345716869,"categories":[{"id":7024776435},{"id":7034733899},{"id":7034738719}]},{"id":2328841453,"categories":[{"id":7024776435},{"id":7034733899},{"id":7034738719}]}]}]}